
# поправьте код, чтобы выводилось число
# на 10 больше, чем введённое
# например, пользователь ввел 10 
# программа вывела 20
	
v = input('Введите число от 1 до 10: ')
print(int(v)+10) 

	
# поправьте код, чтобы выводилась строка
# Привет, ИМЯ! Как дела?

name = input('Введите ваше имя: ')
print(f'Привет, {name.upper()}, как дела?') 


# Выведите на экран при помощи print() результат работы:
	
print(float('1'))
print(int(2.5))
print(bool(1)) 
print(bool(''))
print(bool(0))
